spree_quantity_promo/app/models/spree/promotion/rules/quantity.rb

SELECT SUM("spree_line_items"."quantity") FROM "spree_line_items" WHERE "spree_line_items"."order_id" = $1
---
        def eligible?(order, options = {})
          line_items_count = order.line_items.sum(:quantity)