app/views/spree/orders/show.html.erb

SELECT  "spree_shipping_rates".* FROM "spree_shipping_rates" WHERE "spree_shipping_rates"."shipment_id" = $1 AND "spree_shipping_rates"."selected" = $2  ORDER BY cost ASC LIMIT 1
---
              <dt><%= t(:shipping_method) %> <%= link_to "(#{t(:edit)})", checkout_state_path(:delivery) unless @order.completed? %></dt>
              <dd><%= Spree.t(:shipment_details, stock_location: shipment.stock_location.name, shipping_method: shipment.selected_shipping_rate.name) %></dd>

SELECT "spree_line_items".* FROM "spree_line_items" WHERE "spree_line_items"."order_id" = $1  ORDER BY spree_line_items.created_at ASC
---
  <ul class="shopping-bag">
    <% @order.line_items.each do |item| %>