spree_decimal_quantity/app/models/inventory_unit_builder_decorator.rb

SELECT "spree_line_items".* FROM "spree_line_items" WHERE "spree_line_items"."order_id" = $1  ORDER BY spree_line_items.created_at ASC
---
  def units
    @order.line_items.flat_map do |line_item|
      @order.inventory_units.includes(
          variant: {
              product: {
                  shipping_category: {
                      shipping_methods: [:calculator, { zones: :zone_members }]
                  }
              }
          }
      ).build(
          pending: true,
          variant: line_item.variant,
          line_item: line_item,
          order: @order,
          quantity: line_item.quantity
      )