app/models/order_decorator.rb

  def delivery_quote_needed?
    Spree::ShippingMethod.available_on_frontend.empty?
---
SELECT COUNT(*) FROM "spree_shipping_methods" WHERE "spree_shipping_methods"."deleted_at" IS NULL AND (display_on is null or display_on != 'back_end')

  def mollie_payment_method
    available_payment_methods.select{ |pm| pm.instance_of?(Spree::PaymentMethod::Mollie) }.first
---
SELECT "spree_payment_methods".* FROM "spree_payment_methods" WHERE "spree_payment_methods"."deleted_at" IS NULL