spree-html-email/app/views/spree/shared/email/_order_details.html.erb

    </tr>
    <% order.line_items.each do |item| %>
---
SELECT "spree_line_items".* FROM "spree_line_items" WHERE "spree_line_items"."order_id" = $1  ORDER BY spree_line_items.created_at ASC

    <% end %>
    <% @order.shipments.group_by { |s| s.selected_shipping_rate.try(:name) }.each do |name, shipments| %>
---
SELECT  "spree_shipping_rates".* FROM "spree_shipping_rates" WHERE "spree_shipping_rates"."shipment_id" = $1 AND "spree_shipping_rates"."selected" = $2  ORDER BY cost ASC LIMIT 1