app/controllers/spree/admin/collection_images_controller.rb

			def create
				@collection_image = CollectionImage.new(collection_image_params)
				if @collection_image.save
---
INSERT INTO "collection_images" ("name", "position", "url", "attachment_file_name", "attachment_content_type", "attachment_file_size", "attachment_updated_at", "new_tab", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

			def edit
				@collection_image = CollectionImage.find(params[:id])
---
SELECT  "collection_images".* FROM "collection_images" WHERE "collection_images"."id" = $1 LIMIT 1